In [146]:
import pandas as pd
df=pd.read_csv("Churn_Modelling.csv")
df.head()

,RowNumber,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,1,15634602,Hargrave,619,France,Female,42,2,0.00,1,1,1,101348.88,1
1,2,15647311,Hill,608,Spain,Female,41,1,83807.86,1,0,1,112542.58,0
2,3,15619304,Onio,502,France,Female,42,8,159660.80,3,1,0,113931.57,1
3,4,15701354,Boni,699,France,Female,39,1,0.00,2,0,0,93826.63,0
4,5,15737888,Mitchell,850,Spain,Female,43,2,125510.82,1,1,1,79084.10,0

In [ ]:
import pandas as pd 
import numpy as n
import matplotlib.pyploy as plt

# INDEXING

In [147]:

df.set_index("RowNumber", inplace=True)
df.head()

,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
RowNumber,,,,,,,,,,,,,
1,15634602,Hargrave,619,France,Female,42,2,0.00,1,1,1,101348.88,1
2,15647311,Hill,608,Spain,Female,41,1,83807.86,1,0,1,112542.58,0
3,15619304,Onio,502,France,Female,42,8,159660.80,3,1,0,113931.57,1
4,15701354,Boni,699,France,Female,39,1,0.00,2,0,0,93826.63,0
5,15737888,Mitchell,850,Spain,Female,43,2,125510.82,1,1,1,79084.10,0

# DROPING

In [148]:
df.drop(["CustomerId", "Surname"] ,axis=1, inplace=True)
df.head()

,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
RowNumber,,,,,,,,,,,
1,619,France,Female,42,2,0.00,1,1,1,101348.88,1
2,608,Spain,Female,41,1,83807.86,1,0,1,112542.58,0
3,502,France,Female,42,8,159660.80,3,1,0,113931.57,1
4,699,France,Female,39,1,0.00,2,0,0,93826.63,0
5,850,Spain,Female,43,2,125510.82,1,1,1,79084.10,0

In [149]:
df.describe()

,CreditScore,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
count,10000.000000,10000.000000,10000.000000,10000.000000,10000.000000,10000.00000,10000.000000,10000.000000,10000.000000
mean,650.528800,38.921800,5.012800,76485.889288,1.530200,0.70550,0.515100,100090.239881,0.203700
std,96.653299,10.487806,2.892174,62397.405202,0.581654,0.45584,0.499797,57510.492818,0.402769
min,350.000000,18.000000,0.000000,0.000000,1.000000,0.00000,0.000000,11.580000,0.000000
25%,584.000000,32.000000,3.000000,0.000000,1.000000,0.00000,0.000000,51002.110000,0.000000
50%,652.000000,37.000000,5.000000,97198.540000,1.000000,1.00000,1.000000,100193.915000,0.000000
75%,718.000000,44.000000,7.000000,127644.240000,2.000000,1.00000,1.000000,149388.247500,0.000000
max,850.000000,92.000000,10.000000,250898.090000,4.000000,1.00000,1.000000,199992.480000,1.000000

# Age category
Exited category
Geography category
Balance Category
Tenure Category
Credit score

In [151]:
Age_df=df[(df['Age']>= 18) & (df["Age"]<=29)]
Age_df.head()

,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
RowNumber,,,,,,,,,,,
8,376,Germany,Female,29,4,115046.74,4,1,0,119346.88,1
10,684,France,Male,27,2,134603.88,1,1,1,71725.73,0
12,497,Spain,Male,24,3,0.00,2,1,0,76390.01,0
14,549,France,Female,25,5,0.00,2,0,0,190857.79,0
18,549,Spain,Female,24,9,0.00,2,1,1,14406.41,0

In [152]:
Age_df['Gender'].value_counts()

Male      891
Female    750
Name: Gender, dtype: int64

In [153]:
print("In this dataset (Raw & Colum): " ,df.shape)

In this dataset (Raw & Colum):  (10000, 11)

In [154]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 10000 entries, 1 to 10000
Data columns (total 11 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   CreditScore      10000 non-null  int64
 1   Geography        10000 non-null  object
 2   Gender           10000 non-null  object
 3   Age              10000 non-null  int64
 4   Tenure           10000 non-null  int64
 5   Balance          10000 non-null  float64
 6   NumOfProducts    10000 non-null  int64
 7   HasCrCard        10000 non-null  int64
 8   IsActiveMember   10000 non-null  int64
 9   EstimatedSalary  10000 non-null  float64
 10  Exited           10000 non-null  int64
dtypes: float64(2), int64(7), object(2)
memory usage: 937.5+ KB

In [155]:
df.isnull().sum()

CreditScore        0
Geography          0
Gender             0
Age                0
Tenure             0
Balance            0
NumOfProducts      0
HasCrCard          0
IsActiveMember     0
EstimatedSalary    0
Exited             0
dtype: int64

# ANALYSIS FROM GEOGRAPHY

In [156]:
df["Geography"].unique()

array(['France', 'Spain', 'Germany'], dtype=object)

In [157]:
df["Geography"].value_counts()

France     5014
Germany    2509
Spain      2477
Name: Geography, dtype: int64

In [158]:
Geography_df=df[df["Geography"]=="France"]
Geography_df.head()

,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
RowNumber,,,,,,,,,,,
1,619,France,Female,42,2,0.00,1,1,1,101348.88,1
3,502,France,Female,42,8,159660.80,3,1,0,113931.57,1
4,699,France,Female,39,1,0.00,2,0,0,93826.63,0
7,822,France,Male,50,7,0.00,2,1,1,10062.80,0
9,501,France,Male,44,4,142051.07,2,0,1,74940.50,0

In [159]:
Geography_df["Gender"].value_counts()

Male      2753
Female    2261
Name: Gender, dtype: int64

In [160]:
Geography_df["Age"].value_counts()

38    249
34    247
37    244
33    235
40    233
     ...
78      2
92      2
82      1
85      1
84      1
Name: Age, Length: 68, dtype: int64

In [161]:
Geography_df["Age"].mean()

38.51176705225369

In [162]:
Geography_df["Age"].mode()

0    38
Name: Age, dtype: int64

In [163]:
Geography_df["Age"].median()

37.0

In [164]:
Geography_df["Exited"].value_counts()

0    4204
1     810
Name: Exited, dtype: int64

In [165]:
Geography_df["IsActiveMember"].value_counts()

1    2591
0    2423
Name: IsActiveMember, dtype: int64

# GERMANY

In [166]:
Geography_df=df[df["Geography"]=="Germany"]
Geography_df.head()

,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
RowNumber,,,,,,,,,,,
8,376,Germany,Female,29,4,115046.74,4,1,0,119346.88,1
16,616,Germany,Male,45,3,143129.41,2,0,1,64327.26,0
17,653,Germany,Male,58,1,132602.88,1,1,0,5097.67,1
27,756,Germany,Male,36,2,136815.64,1,1,1,170041.95,0
29,574,Germany,Female,43,3,141349.43,1,1,1,100187.43,0

In [167]:
Geography_df["Gender"].value_counts()

Male      1316
Female    1193
Name: Gender, dtype: int64

In [212]:
Geography_df.shape

(2477, 11)

In [168]:
Geography_df["Age"].value_counts()

37    128
35    113
40    106
33    103
41    102
     ...
84      1
81      1
73      1
83      1
78      1
Name: Age, Length: 64, dtype: int64

In [169]:
Geography_df["Age"].mean()

39.771622160223195

In [170]:
Geography_df["Age"].mode()

0    37
Name: Age, dtype: int64

In [171]:
Geography_df["Age"].median()

38.0

In [172]:
Geography_df["IsActiveMember"].value_counts()

0    1261
1    1248
Name: IsActiveMember, dtype: int64

In [173]:
Geography_df["Exited"].value_counts()

0    1695
1     814
Name: Exited, dtype: int64

# SPAIN

In [174]:
Geography_df=df[df["Geography"]=="Spain"]
Geography_df.head()

,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
RowNumber,,,,,,,,,,,
2,608,Spain,Female,41,1,83807.86,1,0,1,112542.58,0
5,850,Spain,Female,43,2,125510.82,1,1,1,79084.10,0
6,645,Spain,Male,44,8,113755.78,2,1,0,149756.71,1
12,497,Spain,Male,24,3,0.00,2,1,0,76390.01,0
15,635,Spain,Female,35,7,0.00,2,1,1,65951.65,0

In [175]:
Geography_df["Gender"].value_counts()

Male      1388
Female    1089
Name: Gender, dtype: int64

In [176]:
Geography_df["Age"].value_counts()

35    131
38    130
36    128
39    121
34    109
     ...
73      2
78      2
80      1
88      1
79      1
Name: Age, Length: 64, dtype: int64

In [177]:
Geography_df["Age"].mean()

38.89099717400081

In [178]:
Geography_df["Age"].mode()

0    35
Name: Age, dtype: int64

In [179]:
Geography_df["Age"].median()

37.0

In [180]:
Geography_df["IsActiveMember"].value_counts()

1    1312
0    1165
Name: IsActiveMember, dtype: int64

In [181]:
Geography_df["Exited"].value_counts()

0    2064
1     413
Name: Exited, dtype: int64

# Gender

In [182]:
df["Gender"].unique()

array(['Female', 'Male'], dtype=object)

In [183]:
df["Gender"].value_counts()

Male      5457
Female    4543
Name: Gender, dtype: int64

In [184]:
Gender_df=df[df["Gender"]=="Male"]
Gender_df.head()

,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
RowNumber,,,,,,,,,,,
6,645,Spain,Male,44,8,113755.78,2,1,0,149756.71,1
7,822,France,Male,50,7,0.00,2,1,1,10062.80,0
9,501,France,Male,44,4,142051.07,2,0,1,74940.50,0
10,684,France,Male,27,2,134603.88,1,1,1,71725.73,0
11,528,France,Male,31,6,102016.72,2,0,0,80181.12,0

In [185]:
Gender_df['Age'].unique()

array([44, 50, 27, 31, 24, 45, 58, 41, 46, 25, 36, 29, 33, 40, 38, 42, 43,
       19, 51, 35, 56, 26, 55, 22, 30, 34, 32, 39, 28, 52, 37, 57, 65, 47,
       54, 72, 20, 67, 62, 49, 59, 68, 23, 61, 60, 48, 53, 64, 18, 69, 21,
       74, 63, 70, 71, 76, 66, 77, 88, 73, 84, 79, 80, 75, 81, 92, 83, 78])

In [186]:
Gender_df['Age'].mean()

38.658237126626354

In [187]:
Gender_df['Age'].median()

37.0

In [188]:
Gender_df['Age'].mode()

0    37
Name: Age, dtype: int64

In [189]:
Gender_df['Geography'].unique()

array(['Spain', 'France', 'Germany'], dtype=object)

In [190]:
Gender_df['Geography'].value_counts()

France     2753
Spain      1388
Germany    1316
Name: Geography, dtype: int64

In [191]:
Gender_df['Exited'].value_counts()

0    4559
1     898
Name: Exited, dtype: int64

In [192]:
Gender_df['EstimatedSalary'].value_counts()

24924.92     2
149756.71    1
112668.06    1
4554.67      1
193018.71    1
            ..
190294.12    1
23067.97     1
197562.08    1
2797.27      1
92888.52     1
Name: EstimatedSalary, Length: 5456, dtype: int64

In [193]:
Gender_df['Balance'].value_counts()

0.00         1963
130170.82       2
142946.18       1
154377.30       1
107511.52       1
             ...
103176.62       1
94216.05        1
106770.82       1
133191.19       1
75075.31        1
Name: Balance, Length: 3494, dtype: int64

In [194]:
Gender_df['HasCrCard'].value_counts()

1    3863
0    1594
Name: HasCrCard, dtype: int64

In [195]:
Gender_df['Tenure'].value_counts()

8     592
2     568
7     564
5     564
9     562
1     557
4     547
3     540
6     509
10    245
0     209
Name: Tenure, dtype: int64

In [196]:
Gender_df['NumOfProducts'].value_counts()

1    2788
2    2530
3     117
4      22
Name: NumOfProducts, dtype: int64

# FEMALE

In [197]:
Gender_df=df[df["Gender"]=="Female"]
Gender_df.head()

,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
RowNumber,,,,,,,,,,,
1,619,France,Female,42,2,0.00,1,1,1,101348.88,1
2,608,Spain,Female,41,1,83807.86,1,0,1,112542.58,0
3,502,France,Female,42,8,159660.80,3,1,0,113931.57,1
4,699,France,Female,39,1,0.00,2,0,0,93826.63,0
5,850,Spain,Female,43,2,125510.82,1,1,1,79084.10,0

In [198]:
Gender_df['Age'].mean()

39.238388729914156

In [199]:
Gender_df['Age'].mode()

0    35
Name: Age, dtype: int64

In [200]:
Gender_df['Age'].median()

38.0

In [201]:
Gender_df['Geography'].value_counts()

France     2261
Germany    1193
Spain      1089
Name: Geography, dtype: int64

In [202]:
Gender_df['Exited'].value_counts()

0    3404
1    1139
Name: Exited, dtype: int64

In [203]:
Gender_df['EstimatedSalary'].value_counts()

101348.88    1
186785.01    1
190155.13    1
109394.62    1
161304.68    1
            ..
198224.38    1
147964.99    1
161069.73    1
127749.61    1
38190.78     1
Name: EstimatedSalary, Length: 4543, dtype: int64

In [204]:
Gender_df['IsActiveMember'].value_counts()

1    2284
0    2259
Name: IsActiveMember, dtype: int64

In [205]:
Gender_df['Balance'].value_counts()

0.00         1654
107199.75       1
126663.51       1
140273.47       1
123943.18       1
             ...
75170.54        1
105795.90       1
118097.87       1
135946.26       1
130142.79       1
Name: Balance, Length: 2890, dtype: int64

In [206]:
Gender_df['HasCrCard'].value_counts()

1    3192
0    1351
Name: HasCrCard, dtype: int64

In [207]:
Gender_df['Tenure'].value_counts()

2     480
1     478
3     469
7     464
6     458
5     448
4     442
8     433
9     422
10    245
0     204
Name: Tenure, dtype: int64

In [208]:
Gender_df['NumOfProducts'].value_counts()

1    2296
2    2060
3     149
4      38
Name: NumOfProducts, dtype: int64

# ACTIVE MEMBERS

In [209]:
df['IsActiveMember'].value_counts()

1    5151
0    4849
Name: IsActiveMember, dtype: int64

In [210]:
df['HasCrCard'].value_counts()

1    7055
0    2945
Name: HasCrCard, dtype: int64

In [211]:
df['NumOfProducts'].value_counts()

1    5084
2    4590
3     266
4      60
Name: NumOfProducts, dtype: int64